content/man/man1/git-diagnose.1.org
#+TITLE: Manpages - git-diagnose.1
* NAME
git-diagnose - Generate a zip archive of diagnostic information

* SYNOPSIS
#+begin_example
git diagnose [(-o | --output-directory) <path>] [(-s | --suffix) <format>]
               [--mode=<mode>]
#+end_example

* DESCRIPTION
Collects detailed information about the user's machine, Git client, and
repository state and packages that information into a zip archive. The
generated archive can then, for example, be shared with the Git mailing
list to help debug an issue or serve as a reference for independent
debugging.

By default, the following information is captured in the archive:

#+begin_quote
·

/git version --build-options/

#+end_quote

#+begin_quote
·

The path to the repository root

#+end_quote

#+begin_quote
·

The available disk space on the filesystem

#+end_quote

#+begin_quote
·

The name and size of each packfile, including those in alternate object
stores

#+end_quote

#+begin_quote
·

The total count of loose objects, as well as counts broken down by
*.git/objects* subdirectory

#+end_quote

Additional information can be collected by selecting a different
diagnostic mode using the *--mode* option.

This tool differs from *git-bugreport*(1) in that it collects much more
detailed information with a greater focus on reporting the size and data
shape of repository contents.

* OPTIONS
-o <path>, --output-directory <path>

#+begin_quote
Place the resulting diagnostics archive in *<path>* instead of the
current directory.

#+end_quote

-s <format>, --suffix <format>

#+begin_quote
Specify an alternate suffix for the diagnostics archive name, to create
a file named /git-diagnostics-<formatted-suffix>/. This should take the
form of a strftime(3) format string; the current local time will be
used.

#+end_quote

--mode=(stats|all)

#+begin_quote
Specify the type of diagnostics that should be collected. The default
behavior of /git diagnose/ is equivalent to *--mode=stats*.

The *--mode=all* option collects everything included in *--mode=stats*,
as well as copies of *.git*, *.git/hooks*, *.git/info*, *.git/logs*, and
*.git/objects/info* directories. This additional information may be
sensitive, as it can be used to reconstruct the full contents of the
diagnosed repository. Users should exercise caution when sharing an
archive generated with *--mode=all*.

#+end_quote

* GIT
Part of the *git*(1) suite
